# ViewSolarstudyMultidayFrameValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyMultidayFrameValue Property
ParameterTypeId Class See Also
---
"Multi-day frame"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyMultidayFrameValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyMultidayFrameValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyMultidayFrameValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace